app/Controllers/Api.php

SELECT *
FROM `weathers`
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function get_weather()
    {
        $model = new Weather();
        $data = $model->orderBy('created_at', 'desc')->first();

SELECT *
FROM `weathers`
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function send_sipasi()
    {
        $USER_KEY = 'a1244e12f5467458D5mb8568565';  //base_64 IP+User_id sipasi
        $url = 'https://sdg.sipasi.online/api?api_key=' . $USER_KEY;

        $model = new Weather();
        $data = $model->orderBy('created_at', 'desc')->first();